#ifndef CHARSET_04_H_
#define CHARSET_04_H_

#include <stdio.h>
#include "charset.h"

#ifdef CHARSET_04_IMPLEMENTATION
	Charset charset04 = {
		.cell_w = 10,
		.cell_h = 7,
		.data = (Cells){
			(Cell){
				"          ",
				" кТФФФФФП ",
				" ГГкФФТПГ ",
				" ГГГ  ГГГ ",
				" ГГГ  ГГГ ",
				" ГГРФФСйГ ",
				" РСФФФФФй ",
			},
			(Cell){
				"          ",
				" лллллллП ",
				" ллкФФллГ ",
				" ллГ  ллГ ",
				" ллГ  ллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				"          ",
				"    ллП   ",
				"    ллГ   ",
				"    ллГ   ",
				"    ллГ   ",
				"    ллГ   ",
				"    РФй   ",
			},
			(Cell){
				"          ",
				" лллллллП ",
				" РФФФФллГ ",
				" лллллллГ ",
				" ллкФФФФй ",
				" лллллллП ",
				" РФФФФФФй ",
			},
			(Cell){
				"          ",
				" лллллллП ",
				" РФФФФллГ ",
				"  ллллллГ ",
				"  РФФФллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				"          ",
				" ллП  ллП ",
				" ллГ  ллГ ",
				" лллллллГ ",
				" РФФФФллГ ",
				"      ллГ ",
				"      РФй ",
			},
			(Cell){
				"          ",
				" лллллллП ",
				" ллкФФФФй ",
				" лллллллП ",
				" РФФФФллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				"          ",
				" лллллллП ",
				" ллкФФФФй ",
				" лллллллП ",
				" ллкФФллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				"          ",
				" лллллллП ",
				" РФФФФллГ ",
				"      ллГ ",
				"      ллГ ",
				"      ллГ ",
				"      РФй ",
			},
			(Cell){
				"          ",
				" лллллллП ",
				" ллкФФллГ ",
				" лллллллГ ",
				" ллкФФллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				"          ",
				" лллллллП ",
				" ллкФФллГ ",
				" лллллллГ ",
				" РФФФФллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				"          ",
				"          ",
				"    ллП   ",
				"    РФй   ",
				"    ллП   ",
				"    РФй   ",
				"          ",
			},
		}
	};

#endif
#endif
