#ifndef CHARSET_05_H_
#define CHARSET_05_H_

#include <stdio.h>
#include "charset.h"

// ВВлл

#ifdef CHARSET_05_IMPLEMENTATION
	Charset charset05 = {
		.cell_w = 10,
		.cell_h = 6,
		.data = (Cells){
			(Cell){
				" кТФФФФФП ",
				" ГГкФФТПГ ",
				" ГГГ  ГГГ ",
				" ГГГ  ГГГ ",
				" ГГРФФСйГ ",
				" РСФФФФФй ",
			},
			(Cell){
				" лллллллП ",
				" ллкФФллГ ",
				" ллГ  ллГ ",
				" ллГ  ллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				"    ллП   ",
				"    ллГ   ",
				"    ллГ   ",
				"    ллГ   ",
				"    ллГ   ",
				"    РФй   ",
			},
			(Cell){
				" лллллллП ",
				" РФФФФллГ ",
				" лллллллГ ",
				" ллкФФФФй ",
				" лллллллП ",
				" РФФФФФФй ",
			},
			(Cell){
				" лллллллП ",
				" РФФФФллГ ",
				"  ллллллГ ",
				"  РФФФллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				" ллП  ллП ",
				" ллГ  ллГ ",
				" лллллллГ ",
				" РФФФФллГ ",
				"      ллГ ",
				"      РФй ",
			},
			(Cell){
				" лллллллП ",
				" ллкФФФФй ",
				" лллллллП ",
				" РФФФФллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				" лллллллП ",
				" ллкФФФФй ",
				" лллллллП ",
				" ллкФФллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				" лллллллП ",
				" РФФФФллГ ",
				"      ллГ ",
				"      ллГ ",
				"      ллГ ",
				"      РФй ",
			},
			(Cell){
				" лллллллП ",
				" ллкФФллГ ",
				" лллллллГ ",
				" ллкФФллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				" лллллллП ",
				" ллкФФллГ ",
				" лллллллГ ",
				" РФФФФллГ ",
				" лллллллГ ",
				" РФФФФФФй ",
			},
			(Cell){
				"          ",
				"    ллП   ",
				"    РФй   ",
				"    ллП   ",
				"    РФй   ",
				"          ",
			},
		}
	};

#endif
#endif
