/*
  здддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
  Ё                                                                                  Ё
  Ё   шшшшшшш  шшшшшшш             шшшшшшш   шш   шш             шшшшшшш   шшшшшшш   Ё
  Ё   шш   шш       шш     шшш          шш   шш   шш     шшш     шш        шш        Ё
  Ё   шш   шш  шшшшшшш               шшшшш   шшшшшшш             шшшшшшш   шшшшшшш   Ё
  Ё   шш   шш  шш          шшш          шш        шш     шшш          шш   шш   шш   Ё
  Ё   шшшшшшш  шшшшшшш             шшшшшшш        шш             шшшшшшш   шшшшшшш   Ё
  Ё                                                                                  Ё
  юдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
*/

#ifndef CHARSET_05_H_
#define CHARSET_05_H_

#include <stdio.h>
#include "charset.h"

#ifdef CHARSET_05_IMPLEMENTATION
	Charset charset05 = {
		.cell_w = 10,
		.cell_h = 6,
		.data = (Cells){
			(Cell){
				" збддддд© ",
				" ЁЁзддб©Ё ",
				" ЁЁЁ  ЁЁЁ ",
				" ЁЁЁ  ЁЁЁ ",
				" ЁЁюддаыЁ ",
				" юаддддды ",
			},
			(Cell){
				" збддддд© ",
				" ЁЁзддб©Ё ",
				" ЁЁЁ  ЁЁЁ ",
				" ЁЁЁ  ЁЁЁ ",
				" ЁЁюддаыЁ ",
				" юаддддды ",
			},
			(Cell){
				"    зб©   ",
				"    ЁЁЁ   ",
				"    ЁЁЁ   ",
				"    ЁЁЁ   ",
				"    ЁЁЁ   ",
				"    юаы   ",
			},
			(Cell){
				" збддддд© ",
				" юадддб©Ё ",
				" збдддаыЁ ",
				" ЁЁздддды ",
				" ЁЁюдддд© ",
				" юаддддды ",
			},
			(Cell){
				" збддддд© ",
				" юадддб©Ё ",
				"  збддаыЁ ",
				"  юаддб©Ё ",
				" збдддаыЁ ",
				" юаддддды ",
			},
			(Cell){
				" зб©  зб© ",
				" ЁЁЁ  ЁЁЁ ",
				" ЁЁюддаыЁ ",
				" юадддб©Ё ",
				"      ЁЁЁ ",
				"      юаы ",
			},
			(Cell){
				" збддддд© ",
				" ЁЁздддды ",
				" ЁЁюдддд© ",
				" юаддб© Ё ",
				" збддаы Ё ",
				" юаддддды ",
			},
			(Cell){
				" збддддд© ",
				" ЁЁздддды ",
				" ЁЁюдддд© ",
				" ЁЁзддб©Ё ",
				" ЁЁюддаыЁ ",
				" юаддддды ",
			},
			(Cell){
				" збддддд© ",
				" юадддб©Ё ",
				"      ЁЁЁ ",
				"      ЁЁЁ ",
				"      ЁЁЁ ",
				"      юаы ",
			},
			(Cell){
				" збддддд© ",
				" ЁЁзддб©Ё ",
				" ЁЁюддаыЁ ",
				" ЁЁзддб©Ё ",
				" ЁЁюддаыЁ ",
				" юаддддды ",
			},
			(Cell){
				" збддддд© ",
				" ЁЁзддб©Ё ",
				" ЁЁюддаыЁ ",
				" юадддб©Ё ",
				" збдддаыЁ ",
				" юаддддды ",
			},
			(Cell){
				"          ",
				"   збд©   ",
				"   юады   ",
				"   збд©   ",
				"   юады   ",
				"          ",
			},
		}
	};

#endif
#endif
